<template lang="">
  <div class='helpTemp'>
    <div class="item" v-for='(item,ind) in data' :key='ind'>
      <div class="title" v-show='item.title'>{{item.title}}</div>
      <div class="content">{{item.content}}</div>
    </div>
  </div>
</template>
<script>
//  服务协议
let agreement = [{
  title: '定义',
  content: '在本条款中，“您”即指用户，下文中更多地用“您”表述。'
}, {
  content: '“服务”，指华大营养提供的产品、报告解读，内容包括但不限于：文本、图表、其他内容和信息，以及我们对其所做的任何版本以及内容更新。'
}, {
  content: '“个人信息”，是对于个体用户有识别度的信息，在这里包含：用户注册信息、微生物组信息、报告内容、调查问卷信息。'
}]
//  接受条款
let terms = [{
  content: '接受我们的服务前，您需要接受和同意全部的服务条款；一旦接受服务，即为已经接受本协议的全部内容。请您完整阅读或知晓本协议后，接受条款方可接受服务。未满18岁的未成年人需在监护人的允许和知情下进行该服务项目。未来新的服务项目，也会由相应新的条款来进行制约。'
}, {
  title: '接受条款的方式：',
  content: '请在购买页面弹出的相应页面，点击“接受”。同时，您也可以在网页上浏览该服务协议，此外我们也会随样本采集套装寄出一份纸质版本的知情同意书，以方便您阅读。'
}, {
  content: '您需自愿签署本服务协议，中途也可按照协议中的规定申请退出。在遵守本协议的条件下，我们保护您的安全、健康以及应具有的权益。'
}]
//  服务条件
let conditions = [{
  content: '有能力对自己的行为负责，18岁以上的用户，在知悉的情况下，愿意签署服务协议和知情同意书；'
}, {
  content: '未满18岁的用户，须要在法定监护人的同意下和知情下签订相关协议。责任人需要对用户在华大营养所提供的全部信息和言论负责。以及通过签署本协议，同意并签署相应的知情同意书。'
}]
//  服务范围
let scope = [{
  content: '随着服务项目的不断发展和变更，我们没有义务事先通知您将会产生的更新或项目版本。您有权力在任何时候停止该服务而不需特别通知我们，除非您要求关闭在华大营养的账户。对于任何超出该协议或相关条款服务范围的事项，华大精准营养科技有限公司不予以负责。关于接受该服务所需具备的网络资源，需要用户具有可上网的途径以及适用的相关设备。'
}]
//  有关风险
let risk = [{
  conent: '我们不能保证提供全部完整的信息，随着科研的进步和发展，更多信息您可能需要主动通过新版的服务，或是相关医生、遗传咨询师或其他健康护理机构获得。我们鼓励您与相关医生或遗传咨询师进行交流，可以帮助您更好地理解相关结果，以及判断结果对于个人的准确性和适合度。对于健康风险的心理顾虑，以及可能产生的心理问题或其他亚风险，您可以提早咨询或是做相关的检测。'
}, {
  content: '检测结果可能出现您未预期到的内容，例如：可能高于平均水平的肥胖风险，这有可能会在心理上及生活上对您产生一定的困扰，或对您的健康产生一定影响，甚至产生社会、法律、经济上的相关影响。'
}, {
  conetnt: '关于样本失败的处理，如果您的样本出现提取 DNA 量不足或是不符合实验检测要求，我们会寄出新的样本采集管供您再次采样，如果您拒绝，我们将终止为您提供服务；如您接受，请严格按照采样说明进行。违背此协议的用户，再次购买该产品服务，并提供了不可用的样本，我们将有权拒绝任何处理和退款。如因未知因素，产生数据不可用或不准确（称为“误差”），由于这种可能性是预知的，用户无权因误差要求退款。'
}, {
  content: '对于您向他人进行基因信息的分享，应保持慎重，这可能会在保险或是职业雇佣方面影响您的利益。有关问题可以咨询相关律师，我们提醒您注意保护自己的基因信息。个人微生物组信息在医疗上可以提供一定的建议或根据，但不完全等同于专业的医疗建议。'
}]
//  隐私声明
let statement = [{
  content: '使用该服务之前，您需要接受我们有关隐私声明的协议。请您通过购买页面的服务协议包含该声明的《知情同意书》中，点击“同意”服务协议，我们相应的服务才可以执行。即为一旦服务执行，表明您已经接受相关的服务协议。'
}, {
  content: '您同意我们的工作人员对于系统的常规维护、管理和调试。另外，对于基因信息和报告的汇总，我们可将其用于科研机构、科研文章的发表、临床治疗方法的改善、药物的研发、诊断监测设备的开发或相关的第三方机构。但未经过您的同意或特殊的法律情况下，我们不会将您的个人信息向任何的第三方机构公开。'
}, {
  content: '我们有保护您隐私的义务，同时您也知晓如果在司法、法规要求的情况下，我们有权提供您的个人信息，在这种情况下，我们也会做出相应通知。您知晓数据信息能够以各种形式在网络间传播，并且会对于不同设备环境作出调整。除意外出现的网络攻击等情况外，我们会严格限制网络访问。'
}]
//  用户知悉
let aware = [{
  content: '明白微生物检测的用途，是用于为大众提供基于生命科学和生物信息计算的服务产品，并可能将这些数据用于支持科学研究、医疗研发、相关科技产品的开发等。而其结果并不代表任何诊断或医疗结果。'
}, {
  content: '用户需要接受以下样本要求：通过我们提供或指定的器材和方式进行个人粪便样本的采集。本人参与检测需保证提供的是本人的粪便样本。'
}, {
  content: '年满18岁以上用户，或18岁以下用户的法定监护人接受本协议的全部条款内容。'
}, {
  content: '服务地区范围：华大营养只为中国大陆地区的用户提供检测服务，同时也只接受来自中国大陆的样品。除中国大陆以外的其他国家和地区的用户，如果想使用的检测服务，请关注我们合作伙伴发展信息。'
}, {
  content: '一旦您将样本寄达，样本是不可返回的。我们有权对样本进行合理处理，并提供相应的服务。'
}, {
  content: '账户安全对于保护您的隐私信息非常重要，如发生账号未经授权使用等安全问题，请立即联系我们；如果因您个人未保管好而将账户信息泄漏，会很大程度上增大您隐私信息的风险，我们不予以负责。'
}]
//  用户责任
let responsibility = [{
  content: '对于所提供样本产生的商业价值以及科研成果的所有权归华大精准营养有限公司所有，而与个人用户无关。'
}, {
  content: '如果您违背本协议中的条款，我们也将有权力拒绝为您提供现阶段或是将来任何形式的服务，您也需要为公司所付出的劳动力、费用或所带来的任何损失负责。'
}, {
  content: '您保证您所提供的信息的真实、即时、有效和完整性，如因您提供了在知情范围内的不真实信息，我们有权质疑并停止提供服务。您有义务对于在本网站注册的信息进行保密，如有意泄漏账户信息而对您个人或我公司造成损失，我们不予以负责并有权对此提出相应赔偿。'
}]
export default {
  data () {
    return {
      data: []
    }
  },
  created () {
    let {title} = this.$route.meta
    this.getData(title)
  },
  methods: {
    getData (name) {
      switch (name) {
        case '服务协议':
          this.data = agreement
          break
        case '接受条款':
          this.data = terms
          break
        case '服务条件':
          this.data = conditions
          break
        case '服务范围':
          this.data = scope
          break
        case '有关风险':
          this.data = risk
          break
        case '隐私声明':
          this.data = statement
          break
        case '用户知悉':
          this.data = aware
          break
        case '用户责任':
          this.data = responsibility
          break
        default :
          break
      }
    }
  }
}
</script>
<style lang="scss" scoped>
.helpTemp{
  padding: .87rem .4rem 0;
  font-size: .28rem;
  color:#2A3540;
  .item{
    margin-bottom: .5rem;
    .title{
      margin-bottom: .06rem;
    }
    .content{
      line-height: .4rem;
      text-align: justify;
    }
  }
}
</style>
